[{"bodyPart":"upper arms","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/brVJ2ZSEFxkduJ","id":"1727","name":"cable standing reverse grip one arm overhead tricep extension","target":"triceps","secondaryMuscles":["shoulders"],"instructions":["Stand facing away from the cable machine with your feet shoulder-width apart.","Hold the cable handle with an underhand grip and extend your arm overhead, keeping your elbow close to your head.","Keep your upper arm stationary and slowly lower the cable handle behind your head by bending your elbow.","Pause for a moment at the bottom, then extend your arm back to the starting position.","Repeat for the desired number of repetitions, then switch arms."]},{"bodyPart":"back","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/hfw8m8dlUvWHlk","id":"0234","name":"cable standing row (v-bar)","target":"upper back","secondaryMuscles":["biceps","shoulders"],"instructions":["Stand facing the cable machine with your feet shoulder-width apart.","Grasp the v-bar attachment with an overhand grip, palms facing down.","Keep your back straight and your core engaged.","Pull the v-bar towards your body, squeezing your shoulder blades together.","Pause for a moment at the peak of the movement, then slowly release the tension and return to the starting position.","Repeat for the desired number of repetitions."]},{"bodyPart":"shoulders","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/U81T5-XgYJt8YP","id":"0235","name":"cable standing shoulder external rotation","target":"delts","secondaryMuscles":["rotator cuff","trapezius"],"instructions":["Stand with your feet shoulder-width apart and your knees slightly bent.","Hold the cable handle with your arm extended in front of you, parallel to the ground.","Keep your elbow slightly bent and your shoulder blades pulled back.","Slowly rotate your arm outward, away from your body, while keeping your elbow in the same position.","Pause for a moment at the end of the movement, then slowly return to the starting position.","Repeat for the desired number of repetitions."]},{"bodyPart":"back","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/D4KemYl0dY68qp","id":"0236","name":"cable standing twist row (v-bar)","target":"upper back","secondaryMuscles":["biceps","shoulders"],"instructions":["Attach a v-bar attachment to a cable machine at chest height.","Stand facing the cable machine with your feet shoulder-width apart.","Grasp the v-bar with an overhand grip, palms facing down.","Take a step back to create tension in the cable.","Keep your back straight and core engaged throughout the exercise.","Pull the v-bar towards your torso by retracting your shoulder blades and bending your elbows.","As you pull, twist your torso to one side, squeezing your shoulder blades together.","Pause for a moment at the top of the movement, feeling the contraction in your upper back.","Slowly release the tension and return to the starting position, untwisting your torso.","Repeat the movement for the desired number of repetitions, alternating the twisting direction with each rep."]},{"bodyPart":"chest","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/FI54Jw2Q4-yAY7","id":"1269","name":"cable standing up straight crossovers","target":"pectorals","secondaryMuscles":["deltoids","triceps"],"instructions":["Stand in the middle of a cable machine with your feet shoulder-width apart.","Hold the handles of the cables with your palms facing down and your arms extended straight out to the sides.","Keeping your arms straight, bring your hands together in front of your body, crossing them over each other.","Pause for a moment, then slowly return to the starting position, keeping your arms extended.","Repeat for the desired number of repetitions."]},{"bodyPart":"back","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/taybFXmlJ42URM","id":"0238","name":"cable straight arm pulldown","target":"lats","secondaryMuscles":["shoulders","biceps"],"instructions":["Attach a straight bar to the high pulley of a cable machine.","Stand facing the machine with your feet shoulder-width apart.","Grasp the bar with an overhand grip, keeping your arms straight and your palms facing down.","Engage your lats and pull the bar down towards your thighs, keeping your arms straight throughout the movement.","Pause for a moment at the bottom, then slowly return the bar to the starting position.","Repeat for the desired number of repetitions."]},{"bodyPart":"back","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/mEl7iDZvjiJ-OL","id":"0237","name":"cable straight arm pulldown (with rope)","target":"lats","secondaryMuscles":["biceps","forearms"],"instructions":["Attach a rope to the cable machine at the highest setting.","Stand facing the machine with your feet shoulder-width apart.","Grasp the rope with both hands, palms facing down.","Extend your arms fully in front of you, keeping your elbows slightly bent.","Engage your lats and slowly pull the rope down towards your thighs, keeping your arms straight.","Pause for a moment at the bottom, then slowly release the tension and return to the starting position.","Repeat for the desired number of repetitions."]},{"bodyPart":"back","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/Iqe2FzgC97x-4m","id":"0239","name":"cable straight back seated row","target":"upper back","secondaryMuscles":["biceps","forearms","shoulders"],"instructions":["Sit on the cable row machine with your feet flat on the footrests and your knees slightly bent.","Grasp the cable handles with an overhand grip, palms facing down.","Keep your back straight and lean slightly forward from the hips.","Pull the cable handles towards your body, squeezing your shoulder blades together.","Pause for a moment at the peak of the movement, then slowly release the handles back to the starting position.","Repeat for the desired number of repetitions."]},{"bodyPart":"shoulders","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/2BusfuXMOh2yIn","id":"0240","name":"cable supine reverse fly","target":"delts","secondaryMuscles":["trapezius","rhomboids"],"instructions":["Attach a D-handle to a low pulley cable machine and lie face down on a flat bench.","Grasp the D-handle with each hand, palms facing down, and extend your arms straight out in front of you.","Keeping your arms straight, raise them out to the sides until they are parallel to the floor.","Pause for a moment at the top, then slowly lower your arms back down to the starting position.","Repeat for the desired number of repetitions."]},{"bodyPart":"back","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/FoLy76z9v0Jr-T","id":"2464","name":"cable thibaudeau kayak row","target":"lats","secondaryMuscles":["biceps","rhomboids","rear deltoids"],"instructions":["Attach a cable handle to a low pulley and sit facing the machine with your feet flat on the floor.","Grasp the handle with your right hand and extend your arm fully, keeping a slight bend in your elbow.","Lean forward from your hips, keeping your back straight and your abs engaged.","Pull the handle towards your torso by retracting your shoulder blade and bending your elbow, keeping your arm close to your body.","Squeeze your back muscles at the top of the movement, then slowly return to the starting position.","Repeat for the desired number of repetitions, then switch sides and perform with your left arm."]},{"bodyPart":"upper arms","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/wIr9MtLC-GkdyT","id":"0241","name":"cable triceps pushdown (v-bar)","target":"triceps","secondaryMuscles":["forearms"],"instructions":["Attach a v-bar attachment to the cable machine at the highest setting.","Stand facing the cable machine with your feet shoulder-width apart.","Grasp the v-bar with an overhand grip, palms facing down, and your hands shoulder-width apart.","Keep your elbows close to your sides and your upper arms stationary throughout the exercise.","Engage your triceps and exhale as you push the v-bar down until your arms are fully extended.","Pause for a moment at the bottom of the movement, squeezing your triceps.","Inhale as you slowly return the v-bar to the starting position, maintaining control.","Repeat for the desired number of repetitions."]},{"bodyPart":"upper arms","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/-qzTFU89QoVLI6","id":"2405","name":"cable triceps pushdown (v-bar) (with arm blaster)","target":"triceps","secondaryMuscles":["forearms"],"instructions":["Attach a v-bar attachment to the cable machine at the highest setting.","Stand facing the cable machine with your feet shoulder-width apart.","Grasp the v-bar with an overhand grip, palms facing down, and your hands shoulder-width apart.","Keep your elbows close to your sides and your upper arms stationary throughout the exercise.","Engage your triceps and exhale as you push the v-bar down until your arms are fully extended.","Pause for a moment at the bottom of the movement, squeezing your triceps.","Inhale as you slowly return the v-bar to the starting position, maintaining control.","Repeat for the desired number of repetitions."]},{"bodyPart":"waist","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/uxA8CmXrYtFT0q","id":"0242","name":"cable tuck reverse crunch","target":"abs","secondaryMuscles":["hip flexors"],"instructions":["Attach a cable to a low pulley and lie down on a mat facing up.","Hold the cable with both hands and extend your arms straight up above your chest.","Bend your knees and lift your legs up, bringing your knees towards your chest.","At the same time, curl your pelvis up towards your chest, lifting your hips off the ground.","Pause for a moment at the top, then slowly lower your legs and hips back down to the starting position.","Repeat for the desired number of repetitions."]},{"bodyPart":"waist","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/TcdzQGNaLWoFmH","id":"0243","name":"cable twist","target":"abs","secondaryMuscles":["obliques"],"instructions":["Stand with your feet shoulder-width apart, facing the cable machine.","Hold the cable handle with both hands in front of your chest, keeping your arms slightly bent.","Engage your core and twist your torso to the right, pulling the cable across your body.","Pause for a moment at the end of the movement, feeling the contraction in your abs and obliques.","Slowly return to the starting position, resisting the cable's pull.","Repeat the movement to the left side.","Continue alternating sides for the desired number of repetitions."]},{"bodyPart":"waist","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/vMHbut9tdj0qOk","id":"0862","name":"cable twist (up-down)","target":"abs","secondaryMuscles":["obliques","lower back"],"instructions":["Stand with your feet shoulder-width apart, facing the cable machine.","Hold the cable handle with both hands in front of your chest, keeping your arms slightly bent.","Engage your core and slowly rotate your torso to one side, keeping your hips and legs stable.","Pause for a moment at the end of the rotation, then slowly return to the starting position.","Repeat the rotation to the opposite side.","Continue alternating sides for the desired number of repetitions."]},{"bodyPart":"back","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/WLnX12rM3L1Ol6","id":"0244","name":"cable twisting pull","target":"lats","secondaryMuscles":["shoulders","biceps"],"instructions":["Attach a cable handle to a low pulley and stand facing the machine.","Grasp the handle with your left hand and step away from the machine, extending your arm fully.","Position your feet shoulder-width apart, with your knees slightly bent.","Keep your back straight and your core engaged throughout the exercise.","Pull the handle towards your body, rotating your torso to the right as you do so.","Squeeze your back muscles at the end of the movement.","Slowly return to the starting position, keeping tension on the cable.","Repeat for the desired number of repetitions, then switch sides and perform with your right hand."]},{"bodyPart":"upper arms","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/XOcahcCfMnuM3d","id":"1645","name":"cable two arm curl on incline bench","target":"biceps","secondaryMuscles":["forearms"],"instructions":["Sit on an incline bench with your back against the pad and your feet flat on the ground.","Grasp the cable handles with an underhand grip, palms facing up, and your arms fully extended.","Keeping your upper arms stationary, exhale and curl the handles towards your shoulders while contracting your biceps.","Pause for a moment at the top of the movement, squeezing your biceps.","Inhale and slowly lower the handles back to the starting position, fully extending your arms.","Repeat for the desired number of repetitions."]},{"bodyPart":"upper arms","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/JVokPNvfS6xSgI","id":"1728","name":"cable two arm tricep kickback","target":"triceps","secondaryMuscles":["shoulders"],"instructions":["Stand with your feet shoulder-width apart and knees slightly bent.","Hold the cable handle in each hand with your palms facing inwards and your arms bent at a 90-degree angle.","Keeping your upper arms stationary, extend your forearms backwards until your arms are fully extended.","Pause for a moment, then slowly return to the starting position.","Repeat for the desired number of repetitions."]},{"bodyPart":"back","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/jqw-VdfqYSMquV","id":"0245","name":"cable underhand pulldown","target":"lats","secondaryMuscles":["biceps","forearms"],"instructions":["Adjust the cable machine so that the pulldown bar is at a height above your head.","Sit down on the seat and grab the pulldown bar with an underhand grip, hands slightly wider than shoulder-width apart.","Keep your back straight and lean back slightly.","Pull the bar down towards your chest, squeezing your shoulder blades together.","Pause for a moment at the bottom of the movement, then slowly release the bar back up to the starting position.","Repeat for the desired number of repetitions."]},{"bodyPart":"chest","equipment":"cable","gifUrl":"https://v2.exercisedb.io/image/URQc030oXo6knc","id":"1270","name":"cable upper chest crossovers","target":"pectorals","secondaryMuscles":["deltoids","triceps"],"instructions":["Attach the handles to the cables at chest height.","Stand in the center of the cable machine with one foot slightly in front of the other.","Grasp the handles with your palms facing down and your arms extended out to the sides.","Keep a slight bend in your elbows and engage your core.","Pull the cables together in front of your chest, crossing them over each other.","Squeeze your chest muscles at the peak of the movement.","Slowly release the cables back to the starting position.","Repeat for the desired number of repetitions."]}]
